measurements/properties.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programs to Models Through Measurements</title>
<!-- 2014-02-07 Fri 19:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Rafael Turner" />
</head>
<body>
<div id="content">
<h1 class="title">Programs to Models Through Measurements</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. What can be measured?</a>
<ul>
<li><a href="#sec-1-1">1.1. General Features</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. total number of instructions</a></li>
<li><a href="#sec-1-1-2">1.1.2. number/percentage of load operations</a></li>
<li><a href="#sec-1-1-3">1.1.3. number/percentage of store operations</a></li>
<li><a href="#sec-1-1-4">1.1.4. number/percentage of floating point operations</a></li>
<li><a href="#sec-1-1-5">1.1.5. number/percentage of comparison operations</a></li>
<li><a href="#sec-1-1-6">1.1.6. number/percentage of branch operations</a></li>
<li><a href="#sec-1-1-7">1.1.7. percentage of type conversion operations</a></li>
<li><a href="#sec-1-1-8">1.1.8. number/percentage of indirect memory access operations</a></li>
<li><a href="#sec-1-1-9">1.1.9. percentage of long-size operations</a></li>
<li><a href="#sec-1-1-10">1.1.10. average size of basic block</a></li>
<li><a href="#sec-1-1-11">1.1.11. whether a function is a leaf/non-leaf</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Loop based features</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. The maximum nest level in the method starting with 0.</a></li>
<li><a href="#sec-1-2-2">1.2.2. The total number of loops</a></li>
<li><a href="#sec-1-2-3">1.2.3. The number/percentage of the perfect loops</a></li>
<li><a href="#sec-1-2-4">1.2.4. The percentage of loops with the known number of iterations</a></li>
<li><a href="#sec-1-2-5">1.2.5. The percentage of loops that are normalized</a></li>
<li><a href="#sec-1-2-6">1.2.6. The percentage of loops that are ”well-behaved”</a></li>
<li><a href="#sec-1-2-7">1.2.7. The percentage of loops that are independent</a></li>
<li><a href="#sec-1-2-8">1.2.8. The percentage of the inner-loops</a></li>
<li><a href="#sec-1-2-9">1.2.9. The average statement number per loop</a></li>
<li><a href="#sec-1-2-10">1.2.10. The average jump number per loop</a></li>
<li><a href="#sec-1-2-11">1.2.11. Multi-Dimensional Access in the loops (binary)</a></li>
<li><a href="#sec-1-2-12">1.2.12. The total number of subscripts inside the loops</a></li>
<li><a href="#sec-1-2-13">1.2.13. The total number of references inside the loops</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Features of the referenced object</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. size of referenced object</a></li>
<li><a href="#sec-1-3-2">1.3.2. size of the surrounding structure if appropriate</a></li>
<li><a href="#sec-1-3-3">1.3.3. number of objects</a></li>
<li><a href="#sec-1-3-4">1.3.4. number of dereferences</a></li>
<li><a href="#sec-1-3-5">1.3.5. number of references to pointers</a></li>
<li><a href="#sec-1-3-6">1.3.6. number of references to the stack pointer</a></li>
<li><a href="#sec-1-3-7">1.3.7. number of references to the global data pointer</a></li>
<li><a href="#sec-1-3-8">1.3.8. number of additions</a></li>
<li><a href="#sec-1-3-9">1.3.9. number of multiplications</a></li>
<li><a href="#sec-1-3-10">1.3.10. is the referenced object a global?</a></li>
<li><a href="#sec-1-3-11">1.3.11. is it a local variable?</a></li>
<li><a href="#sec-1-3-12">1.3.12. is it a function parameter?</a></li>
<li><a href="#sec-1-3-13">1.3.13. is it an array?</a></li>
<li><a href="#sec-1-3-14">1.3.14. is it a record?</a></li>
<li><a href="#sec-1-3-15">1.3.15. is it a union?</a></li>
<li><a href="#sec-1-3-16">1.3.16. is it a recursive record?</a></li>
<li><a href="#sec-1-3-17">1.3.17. number of points-to targets of the referenced address</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Features of the indirectly referenced objects</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. All features listed referenced and indirectly referenced objects; boolean features become count features (e.g., how many indirect references to arrays)</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Totaled features</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1. Sum of direct and indirect features</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6. Features of the surrounding basic block</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1. number of block predecessors</a></li>
<li><a href="#sec-1-6-2">1.6.2. number of block successors</a></li>
<li><a href="#sec-1-6-3">1.6.3. number of instructions</a></li>
<li><a href="#sec-1-6-4">1.6.4. number of memory instructions</a></li>
<li><a href="#sec-1-6-5">1.6.5. number of loads</a></li>
<li><a href="#sec-1-6-6">1.6.6. number of stores</a></li>
<li><a href="#sec-1-6-7">1.6.7. number of calls</a></li>
<li><a href="#sec-1-6-8">1.6.8. frequency of the block (via static branch prediction)</a></li>
<li><a href="#sec-1-6-9">1.6.9. if nesting depth</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7. Features of the surrounding loop (if appropriate)</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1. number of surrounding loops</a></li>
<li><a href="#sec-1-7-2">1.7.2. number of contained loops</a></li>
<li><a href="#sec-1-7-3">1.7.3. number of blocks (unweighted and weighted by frequency)</a></li>
<li><a href="#sec-1-7-4">1.7.4. number of instructions (unweighted and weighted)</a></li>
<li><a href="#sec-1-7-5">1.7.5. number of memory instructions (unweighted and weighted)</a></li>
<li><a href="#sec-1-7-6">1.7.6. number of loads (unweighted and weighted)</a></li>
<li><a href="#sec-1-7-7">1.7.7. number of stores (unweighted and weighted)</a></li>
<li><a href="#sec-1-7-8">1.7.8. number of calls (unweighted and weighted)</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8. Performance Counter</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1. Hardware interrupts</a></li>
<li><a href="#sec-1-8-2">1.8.2. Cycles stalled on any resource</a></li>
<li><a href="#sec-1-8-3">1.8.3. Cycles with no instruction issue</a></li>
<li><a href="#sec-1-8-4">1.8.4. Total cycles</a></li>
<li><a href="#sec-1-8-5">1.8.5. Instructions completed</a></li>
<li><a href="#sec-1-8-6">1.8.6. Vector/SIMD instructions</a></li>
</ul>
</li>
<li><a href="#sec-1-9">1.9. Floating Point Instruction Statistics</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1. Adds</a></li>
<li><a href="#sec-1-9-2">1.9.2. Multiplies</a></li>
<li><a href="#sec-1-9-3">1.9.3. Total Insns</a></li>
<li><a href="#sec-1-9-4">1.9.4. Total Ops</a></li>
<li><a href="#sec-1-9-5">1.9.5. Cycles Idle</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10. Branch Instruction Statistics</a>
<ul>
<li><a href="#sec-1-10-1">1.10.1. Branch instructions</a></li>
<li><a href="#sec-1-10-2">1.10.2. Cond. Branches Mispredicted</a></li>
<li><a href="#sec-1-10-3">1.10.3. Cond. Branches Taken</a></li>
</ul>
</li>
<li><a href="#sec-1-11">1.11. Level 1 Cache Statistics</a>
<ul>
<li><a href="#sec-1-11-1">1.11.1. Data Cache: Accesses, Hits, Misses</a></li>
<li><a href="#sec-1-11-2">1.11.2. Instruction Cache: Accesses, Hits, Misses, Reads</a></li>
<li><a href="#sec-1-11-3">1.11.3. Load Misses, Store Misses</a></li>
<li><a href="#sec-1-11-4">1.11.4. Total Cache: Accesses, Hits</a></li>
</ul>
</li>
<li><a href="#sec-1-12">1.12. Level 2 Cache Statistics</a>
<ul>
<li><a href="#sec-1-12-1">1.12.1. Data Cache: Accesses, Hits, Misses, Reads, Writes</a></li>
<li><a href="#sec-1-12-2">1.12.2. Instruction Cache: Accesses, Hits, Misses</a></li>
<li><a href="#sec-1-12-3">1.12.3. Load Misses, Store Misses</a></li>
<li><a href="#sec-1-12-4">1.12.4. Total Cache: Accesses, Hits, Misses</a></li>
</ul>
</li>
<li><a href="#sec-1-13">1.13. Translation Lookaside Buffer Statistics</a>
<ul>
<li><a href="#sec-1-13-1">1.13.1. Data translation lookaside buffer misses</a></li>
<li><a href="#sec-1-13-2">1.13.2. Instruction translation lookaside buffer misses</a></li>
<li><a href="#sec-1-13-3">1.13.3. Total translation lookaside buffer misses</a></li>
</ul>
</li>
<li><a href="#sec-1-14">1.14. Sources</a>
<ul>
<li><a href="#sec-1-14-1">1.14.1. Breaking the curse of static analyses: Making compilers intelligent via machine learning</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What can be measured?</h2>
<div class="outline-text-2" id="text-1">
<p>
These are some ways of assigning numbers to objects or events of
programs. Dividing these by type (Boolean, float, etc&#x2026;) as well as
adding examples and descriptions is work in
progress. Your help is very much appreciated. 
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> General Features</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> total number of instructions</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> number/percentage of load operations</h4>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> number/percentage of store operations</h4>
</div>
<div id="outline-container-sec-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> number/percentage of floating point operations</h4>
</div>
<div id="outline-container-sec-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> number/percentage of comparison operations</h4>
</div>
<div id="outline-container-sec-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> number/percentage of branch operations</h4>
</div>
<div id="outline-container-sec-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> percentage of type conversion operations</h4>
</div>
<div id="outline-container-sec-1-1-8" class="outline-4">
<h4 id="sec-1-1-8"><span class="section-number-4">1.1.8</span> number/percentage of indirect memory access operations</h4>
</div>
<div id="outline-container-sec-1-1-9" class="outline-4">
<h4 id="sec-1-1-9"><span class="section-number-4">1.1.9</span> percentage of long-size operations</h4>
</div>
<div id="outline-container-sec-1-1-10" class="outline-4">
<h4 id="sec-1-1-10"><span class="section-number-4">1.1.10</span> average size of basic block</h4>
</div>
<div id="outline-container-sec-1-1-11" class="outline-4">
<h4 id="sec-1-1-11"><span class="section-number-4">1.1.11</span> whether a function is a leaf/non-leaf</h4>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Loop based features</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> The maximum nest level in the method starting with 0.</h4>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> The total number of loops</h4>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> The number/percentage of the perfect loops</h4>
</div>
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> The percentage of loops with the known number of iterations</h4>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> The percentage of loops that are normalized</h4>
</div>
<div id="outline-container-sec-1-2-6" class="outline-4">
<h4 id="sec-1-2-6"><span class="section-number-4">1.2.6</span> The percentage of loops that are ”well-behaved”</h4>
</div>
<div id="outline-container-sec-1-2-7" class="outline-4">
<h4 id="sec-1-2-7"><span class="section-number-4">1.2.7</span> The percentage of loops that are independent</h4>
</div>
<div id="outline-container-sec-1-2-8" class="outline-4">
<h4 id="sec-1-2-8"><span class="section-number-4">1.2.8</span> The percentage of the inner-loops</h4>
</div>
<div id="outline-container-sec-1-2-9" class="outline-4">
<h4 id="sec-1-2-9"><span class="section-number-4">1.2.9</span> The average statement number per loop</h4>
</div>
<div id="outline-container-sec-1-2-10" class="outline-4">
<h4 id="sec-1-2-10"><span class="section-number-4">1.2.10</span> The average jump number per loop</h4>
</div>
<div id="outline-container-sec-1-2-11" class="outline-4">
<h4 id="sec-1-2-11"><span class="section-number-4">1.2.11</span> Multi-Dimensional Access in the loops (binary)</h4>
</div>
<div id="outline-container-sec-1-2-12" class="outline-4">
<h4 id="sec-1-2-12"><span class="section-number-4">1.2.12</span> The total number of subscripts inside the loops</h4>
</div>
<div id="outline-container-sec-1-2-13" class="outline-4">
<h4 id="sec-1-2-13"><span class="section-number-4">1.2.13</span> The total number of references inside the loops</h4>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Features of the referenced object</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> size of referenced object</h4>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> size of the surrounding structure if appropriate</h4>
</div>
<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> number of objects</h4>
</div>
<div id="outline-container-sec-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> number of dereferences</h4>
</div>
<div id="outline-container-sec-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> number of references to pointers</h4>
</div>
<div id="outline-container-sec-1-3-6" class="outline-4">
<h4 id="sec-1-3-6"><span class="section-number-4">1.3.6</span> number of references to the stack pointer</h4>
</div>
<div id="outline-container-sec-1-3-7" class="outline-4">
<h4 id="sec-1-3-7"><span class="section-number-4">1.3.7</span> number of references to the global data pointer</h4>
</div>
<div id="outline-container-sec-1-3-8" class="outline-4">
<h4 id="sec-1-3-8"><span class="section-number-4">1.3.8</span> number of additions</h4>
</div>
<div id="outline-container-sec-1-3-9" class="outline-4">
<h4 id="sec-1-3-9"><span class="section-number-4">1.3.9</span> number of multiplications</h4>
</div>
<div id="outline-container-sec-1-3-10" class="outline-4">
<h4 id="sec-1-3-10"><span class="section-number-4">1.3.10</span> is the referenced object a global?</h4>
</div>
<div id="outline-container-sec-1-3-11" class="outline-4">
<h4 id="sec-1-3-11"><span class="section-number-4">1.3.11</span> is it a local variable?</h4>
</div>
<div id="outline-container-sec-1-3-12" class="outline-4">
<h4 id="sec-1-3-12"><span class="section-number-4">1.3.12</span> is it a function parameter?</h4>
</div>
<div id="outline-container-sec-1-3-13" class="outline-4">
<h4 id="sec-1-3-13"><span class="section-number-4">1.3.13</span> is it an array?</h4>
</div>
<div id="outline-container-sec-1-3-14" class="outline-4">
<h4 id="sec-1-3-14"><span class="section-number-4">1.3.14</span> is it a record?</h4>
</div>
<div id="outline-container-sec-1-3-15" class="outline-4">
<h4 id="sec-1-3-15"><span class="section-number-4">1.3.15</span> is it a union?</h4>
</div>
<div id="outline-container-sec-1-3-16" class="outline-4">
<h4 id="sec-1-3-16"><span class="section-number-4">1.3.16</span> is it a recursive record?</h4>
</div>
<div id="outline-container-sec-1-3-17" class="outline-4">
<h4 id="sec-1-3-17"><span class="section-number-4">1.3.17</span> number of points-to targets of the referenced address</h4>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Features of the indirectly referenced objects</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> All features listed referenced and indirectly referenced objects; boolean features become count features (e.g., how many indirect references to arrays)</h4>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Totaled features</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> Sum of direct and indirect features</h4>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Features of the surrounding basic block</h3>
<div class="outline-text-3" id="text-1-6">
</div><div id="outline-container-sec-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> number of block predecessors</h4>
</div>
<div id="outline-container-sec-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> number of block successors</h4>
</div>
<div id="outline-container-sec-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> number of instructions</h4>
</div>
<div id="outline-container-sec-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> number of memory instructions</h4>
</div>
<div id="outline-container-sec-1-6-5" class="outline-4">
<h4 id="sec-1-6-5"><span class="section-number-4">1.6.5</span> number of loads</h4>
</div>
<div id="outline-container-sec-1-6-6" class="outline-4">
<h4 id="sec-1-6-6"><span class="section-number-4">1.6.6</span> number of stores</h4>
</div>
<div id="outline-container-sec-1-6-7" class="outline-4">
<h4 id="sec-1-6-7"><span class="section-number-4">1.6.7</span> number of calls</h4>
</div>
<div id="outline-container-sec-1-6-8" class="outline-4">
<h4 id="sec-1-6-8"><span class="section-number-4">1.6.8</span> frequency of the block (via static branch prediction)</h4>
</div>
<div id="outline-container-sec-1-6-9" class="outline-4">
<h4 id="sec-1-6-9"><span class="section-number-4">1.6.9</span> if nesting depth</h4>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Features of the surrounding loop (if appropriate)</h3>
<div class="outline-text-3" id="text-1-7">
</div><div id="outline-container-sec-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> number of surrounding loops</h4>
</div>
<div id="outline-container-sec-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> number of contained loops</h4>
</div>
<div id="outline-container-sec-1-7-3" class="outline-4">
<h4 id="sec-1-7-3"><span class="section-number-4">1.7.3</span> number of blocks (unweighted and weighted by frequency)</h4>
</div>
<div id="outline-container-sec-1-7-4" class="outline-4">
<h4 id="sec-1-7-4"><span class="section-number-4">1.7.4</span> number of instructions (unweighted and weighted)</h4>
</div>
<div id="outline-container-sec-1-7-5" class="outline-4">
<h4 id="sec-1-7-5"><span class="section-number-4">1.7.5</span> number of memory instructions (unweighted and weighted)</h4>
</div>
<div id="outline-container-sec-1-7-6" class="outline-4">
<h4 id="sec-1-7-6"><span class="section-number-4">1.7.6</span> number of loads (unweighted and weighted)</h4>
</div>
<div id="outline-container-sec-1-7-7" class="outline-4">
<h4 id="sec-1-7-7"><span class="section-number-4">1.7.7</span> number of stores (unweighted and weighted)</h4>
</div>
<div id="outline-container-sec-1-7-8" class="outline-4">
<h4 id="sec-1-7-8"><span class="section-number-4">1.7.8</span> number of calls (unweighted and weighted)</h4>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Performance Counter</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> Hardware interrupts</h4>
</div>
<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> Cycles stalled on any resource</h4>
</div>
<div id="outline-container-sec-1-8-3" class="outline-4">
<h4 id="sec-1-8-3"><span class="section-number-4">1.8.3</span> Cycles with no instruction issue</h4>
</div>
<div id="outline-container-sec-1-8-4" class="outline-4">
<h4 id="sec-1-8-4"><span class="section-number-4">1.8.4</span> Total cycles</h4>
</div>
<div id="outline-container-sec-1-8-5" class="outline-4">
<h4 id="sec-1-8-5"><span class="section-number-4">1.8.5</span> Instructions completed</h4>
</div>
<div id="outline-container-sec-1-8-6" class="outline-4">
<h4 id="sec-1-8-6"><span class="section-number-4">1.8.6</span> Vector/SIMD instructions</h4>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Floating Point Instruction Statistics</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> Adds</h4>
</div>
<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> Multiplies</h4>
</div>
<div id="outline-container-sec-1-9-3" class="outline-4">
<h4 id="sec-1-9-3"><span class="section-number-4">1.9.3</span> Total Insns</h4>
</div>
<div id="outline-container-sec-1-9-4" class="outline-4">
<h4 id="sec-1-9-4"><span class="section-number-4">1.9.4</span> Total Ops</h4>
</div>
<div id="outline-container-sec-1-9-5" class="outline-4">
<h4 id="sec-1-9-5"><span class="section-number-4">1.9.5</span> Cycles Idle</h4>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Branch Instruction Statistics</h3>
<div class="outline-text-3" id="text-1-10">
</div><div id="outline-container-sec-1-10-1" class="outline-4">
<h4 id="sec-1-10-1"><span class="section-number-4">1.10.1</span> Branch instructions</h4>
</div>
<div id="outline-container-sec-1-10-2" class="outline-4">
<h4 id="sec-1-10-2"><span class="section-number-4">1.10.2</span> Cond. Branches Mispredicted</h4>
</div>
<div id="outline-container-sec-1-10-3" class="outline-4">
<h4 id="sec-1-10-3"><span class="section-number-4">1.10.3</span> Cond. Branches Taken</h4>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Level 1 Cache Statistics</h3>
<div class="outline-text-3" id="text-1-11">
</div><div id="outline-container-sec-1-11-1" class="outline-4">
<h4 id="sec-1-11-1"><span class="section-number-4">1.11.1</span> Data Cache: Accesses, Hits, Misses</h4>
</div>
<div id="outline-container-sec-1-11-2" class="outline-4">
<h4 id="sec-1-11-2"><span class="section-number-4">1.11.2</span> Instruction Cache: Accesses, Hits, Misses, Reads</h4>
</div>
<div id="outline-container-sec-1-11-3" class="outline-4">
<h4 id="sec-1-11-3"><span class="section-number-4">1.11.3</span> Load Misses, Store Misses</h4>
</div>
<div id="outline-container-sec-1-11-4" class="outline-4">
<h4 id="sec-1-11-4"><span class="section-number-4">1.11.4</span> Total Cache: Accesses, Hits</h4>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Level 2 Cache Statistics</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1"><span class="section-number-4">1.12.1</span> Data Cache: Accesses, Hits, Misses, Reads, Writes</h4>
</div>
<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2"><span class="section-number-4">1.12.2</span> Instruction Cache: Accesses, Hits, Misses</h4>
</div>
<div id="outline-container-sec-1-12-3" class="outline-4">
<h4 id="sec-1-12-3"><span class="section-number-4">1.12.3</span> Load Misses, Store Misses</h4>
</div>
<div id="outline-container-sec-1-12-4" class="outline-4">
<h4 id="sec-1-12-4"><span class="section-number-4">1.12.4</span> Total Cache: Accesses, Hits, Misses</h4>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> Translation Lookaside Buffer Statistics</h3>
<div class="outline-text-3" id="text-1-13">
</div><div id="outline-container-sec-1-13-1" class="outline-4">
<h4 id="sec-1-13-1"><span class="section-number-4">1.13.1</span> Data translation lookaside buffer misses</h4>
</div>
<div id="outline-container-sec-1-13-2" class="outline-4">
<h4 id="sec-1-13-2"><span class="section-number-4">1.13.2</span> Instruction translation lookaside buffer misses</h4>
</div>
<div id="outline-container-sec-1-13-3" class="outline-4">
<h4 id="sec-1-13-3"><span class="section-number-4">1.13.3</span> Total translation lookaside buffer misses</h4>
</div>
</div>

<div id="outline-container-sec-1-14" class="outline-3">
<h3 id="sec-1-14"><span class="section-number-3">1.14</span> Sources</h3>
<div class="outline-text-3" id="text-1-14">
</div><div id="outline-container-sec-1-14-1" class="outline-4">
<h4 id="sec-1-14-1"><span class="section-number-4">1.14.1</span> Breaking the curse of static analyses: Making compilers intelligent via machine learning</h4>
<div class="outline-text-4" id="text-1-14-1">
<p>
@inproceedings{alvincz2009breaking,
  title={Breaking the curse of static analyses: Making compilers
  intelligent via machine learning},
    author={Alvincz, Lars and Glesner, Sabine},
      booktitle={Proceedings of the SMART’09 Workshop},
        year={2009}
        }
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
